Revit 2027 API
ComboBoxData Constructor
Constructs a new instance of ComboBoxData.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ComboBoxData(
	string name
)
Public Sub New (
	name As String
)
public:
ComboBoxData(
	String^ name
)
new :
        name : string -> ComboBoxData
Parameters
name String
The internal name of the ComboBoxMember.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when null is passed for name.
ArgumentException | Thrown when an empty string is passed for name.
See Also
Reference
ComboBoxData Class
Autodesk.Revit.UI Namespace